package lt.lhu.unit03br.main;

/*
Составить программу сравнения двух чисел 1 и 2. 
Если 1 меньше 2 – вывести на экран слово «yes», 
в противном случае – слово «no»
 */

public class Task02 {

	public static void main(String[] args) {
		
		int a, b;
		a = 1;
		b = 2;
		
		if (a < b) {
			System.out.println("yes");
		} else { 
			System.out.println("no");
		}
	
	}

}
